In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [5]:
%%sql
use besant2;

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [6]:
%%sql
CREATE TABLE sales_data (
    id INT PRIMARY KEY,
    employee_name VARCHAR(50),
    department VARCHAR(50),
    region VARCHAR(50),
    product VARCHAR(50),
    sales_amount DECIMAL(10,2),
    quantity INT,
    sale_date DATE,
    target DECIMAL(10,2),
    bonus_percent DECIMAL(5,2)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO sales_data VALUES
(1, 'Alice', 'Electronics', 'North', 'Laptop', 1200.00, 3, '2026-02-01', 1000.00, 5.00),
(2, 'Bob', 'Electronics', 'South', 'Tablet', 800.00, 5, '2026-02-02', 900.00, 4.00),
(3, 'Charlie', 'Furniture', 'East', 'Chair', 400.00, 10, '2026-02-03', 500.00, 3.00),
(4, 'Diana', 'Furniture', 'West', 'Desk', 700.00, 4, '2026-02-04', 600.00, 4.50),
(5, 'Evan', 'Clothing', 'North', 'Jacket', 350.00, 8, '2026-02-05', 300.00, 2.50),
(6, 'Fiona', 'Clothing', 'South', 'Shoes', 450.00, 6, '2026-02-06', 400.00, 3.00),
(7, 'George', 'Electronics', 'East', 'Phone', 900.00, 7, '2026-02-07', 850.00, 4.50),
(8, 'Hannah', 'Furniture', 'North', 'Table', 1000.00, 2, '2026-02-08', 950.00, 5.00),
(9, 'Ian', 'Clothing', 'West', 'Shirt', 200.00, 15, '2026-02-09', 250.00, 1.50),
(10, 'Julia', 'Electronics', 'West', 'Headphones', 300.00, 9, '2026-02-10', 350.00, 2.00);

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[]

In [9]:
%%sql
##ROW NUMBER PER DEPARTMENT
SELECT DEPARTMENT, EMPLOYEE_NAME,SALES_AMOUNT,
ROW_NUMBER() OVER(PARTITION BY DEPARTMENT ORDER BY SALES_AMOUNT DESC) AS ROW_NUM
FROM SALES_DATA;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Clothing', 'Fiona', Decimal('450.00'), 1),
 ('Clothing', 'Evan', Decimal('350.00'), 2),
 ('Clothing', 'Ian', Decimal('200.00'), 3),
 ('Electronics', 'Alice', Decimal('1200.00'), 1),
 ('Electronics', 'George', Decimal('900.00'), 2),
 ('Electronics', 'Bob', Decimal('800.00'), 3),
 ('Electronics', 'Julia', Decimal('300.00'), 4),
 ('Furniture', 'Hannah', Decimal('1000.00'), 1),
 ('Furniture', 'Diana', Decimal('700.00'), 2),
 ('Furniture', 'Charlie', Decimal('400.00'), 3)]

In [10]:
%%sql
SELECT DEPARTMENT, EMPLOYEE_NAME,SALES_AMOUNT,
RANK() OVER(PARTITION BY DEPARTMENT ORDER BY SALES_AMOUNT DESC) AS ROW_NUM
FROM SALES_DATA;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Clothing', 'Fiona', Decimal('450.00'), 1),
 ('Clothing', 'Evan', Decimal('350.00'), 2),
 ('Clothing', 'Ian', Decimal('200.00'), 3),
 ('Electronics', 'Alice', Decimal('1200.00'), 1),
 ('Electronics', 'George', Decimal('900.00'), 2),
 ('Electronics', 'Bob', Decimal('800.00'), 3),
 ('Electronics', 'Julia', Decimal('300.00'), 4),
 ('Furniture', 'Hannah', Decimal('1000.00'), 1),
 ('Furniture', 'Diana', Decimal('700.00'), 2),
 ('Furniture', 'Charlie', Decimal('400.00'), 3)]

In [11]:
%%sql
SELECT DEPARTMENT, EMPLOYEE_NAME,SALES_AMOUNT,
DENSE_RANK() OVER(PARTITION BY DEPARTMENT ORDER BY SALES_AMOUNT DESC) AS ROW_NUM
FROM SALES_DATA;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[('Clothing', 'Fiona', Decimal('450.00'), 1),
 ('Clothing', 'Evan', Decimal('350.00'), 2),
 ('Clothing', 'Ian', Decimal('200.00'), 3),
 ('Electronics', 'Alice', Decimal('1200.00'), 1),
 ('Electronics', 'George', Decimal('900.00'), 2),
 ('Electronics', 'Bob', Decimal('800.00'), 3),
 ('Electronics', 'Julia', Decimal('300.00'), 4),
 ('Furniture', 'Hannah', Decimal('1000.00'), 1),
 ('Furniture', 'Diana', Decimal('700.00'), 2),
 ('Furniture', 'Charlie', Decimal('400.00'), 3)]

In [2]:
%%sql
use besant;
DROP TABLE IF EXISTS employee_sales;

CREATE TABLE employee_sales (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    department VARCHAR(50),
    region VARCHAR(50),
    hire_date DATE,
    sales_month VARCHAR(7),
    sales_amount DECIMAL(10,2),
    target_amount DECIMAL(10,2),
    bonus DECIMAL(10,2),
    performance_rating INT
);

INSERT INTO employee_sales VALUES
(101, 'Alice',   'Electronics', 'East',  '2020-01-15', '2026-01', 12500.00, 11000.00, 550.00, 5),
(102, 'Bob',     'Electronics', 'West',  '2021-03-10', '2026-01', 9500.00,  9000.00, 300.00, 4),
(103, 'Charlie', 'Furniture',   'North', '2019-11-20', '2026-01', 9100.00,  9500.00,   0.00, 3),
(104, 'David',   'Furniture',   'South', '2022-07-01', '2026-01', 7600.00,  7000.00, 200.00, 4),
(105, 'Eva',     'Electronics', 'East',  '2023-02-18', '2026-01', 14500.00, 12000.00, 600.00, 5),
(106, 'Frank',   'Grocery',     'West',  '2020-09-25', '2026-01', 6400.00,  6000.00, 150.00, 4),
(107, 'Grace',   'Grocery',     'North', '2021-11-11', '2026-01', 6400.00,  7000.00,   0.00, 3),
(108, 'Hannah',  'Furniture',   'East',  '2022-03-30', '2026-01', 9900.00,  9000.00, 400.00, 5),
(109, 'Ian',     'Electronics', 'South', '2018-10-05', '2026-01', 14500.00, 13000.00, 700.00, 5),
(110, 'Julia',   'Furniture',   'West',  '2019-05-23', '2026-01', 8700.00,  8500.00, 250.00, 4),
(111, 'Kevin',   'Grocery',     'East',  '2020-06-12', '2026-01', 7200.00,  7000.00, 150.00, 4),
(112, 'Liam',    'Electronics', 'North', '2023-01-03', '2026-01', 12500.00, 10000.00,   0.00, 3),
(113, 'Mia',     'Furniture',   'South', '2019-12-22', '2026-01', 9900.00,  9500.00, 300.00, 4),
(114, 'Noah',    'Grocery',     'West',  '2022-05-14', '2026-01', 6600.00,  6000.00, 100.00, 4),
(115, 'Olivia',  'Electronics', 'North', '2020-04-19', '2026-01', 12500.00, 11000.00, 550.00, 5),
(116, 'Paul',    'Furniture',   'East',  '2021-08-08', '2026-01', 8200.00,  9000.00,   0.00, 3),
(117, 'Quinn',   'Grocery',     'South', '2020-10-27', '2026-01', 7500.00,  7000.00, 200.00, 4),
(118, 'Ryan',    'Furniture',   'West',  '2018-06-16', '2026-01', 9100.00,  8500.00, 250.00, 4),
(119, 'Sophia',  'Electronics', 'South', '2019-09-09', '2026-01', 14500.00, 12000.00, 600.00, 5),
(120, 'Thomas',  'Grocery',     'North', '2021-02-17', '2026-01', 7200.00,  7500.00,   0.00, 3);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
20 rows affected.

[]

In [3]:
%%sql
##show the row number of each employee within their department based on decending sales 
select emp_id,
emp_name,
department,
sales_amount,
 row_number() over(partition by department order by sales_amount desc )
from employee_sales;

 * mysql+mysqlconnector://root:***@localhost
20 rows affected.

[(105, 'Eva', 'Electronics', Decimal('14500.00'), 1),
 (109, 'Ian', 'Electronics', Decimal('14500.00'), 2),
 (119, 'Sophia', 'Electronics', Decimal('14500.00'), 3),
 (101, 'Alice', 'Electronics', Decimal('12500.00'), 4),
 (112, 'Liam', 'Electronics', Decimal('12500.00'), 5),
 (115, 'Olivia', 'Electronics', Decimal('12500.00'), 6),
 (102, 'Bob', 'Electronics', Decimal('9500.00'), 7),
 (108, 'Hannah', 'Furniture', Decimal('9900.00'), 1),
 (113, 'Mia', 'Furniture', Decimal('9900.00'), 2),
 (103, 'Charlie', 'Furniture', Decimal('9100.00'), 3),
 (118, 'Ryan', 'Furniture', Decimal('9100.00'), 4),
 (110, 'Julia', 'Furniture', Decimal('8700.00'), 5),
 (116, 'Paul', 'Furniture', Decimal('8200.00'), 6),
 (104, 'David', 'Furniture', Decimal('7600.00'), 7),
 (117, 'Quinn', 'Grocery', Decimal('7500.00'), 1),
 (111, 'Kevin', 'Grocery', Decimal('7200.00'), 2),
 (120, 'Thomas', 'Grocery', Decimal('7200.00'), 3),
 (114, 'Noah', 'Grocery', Decimal('6600.00'), 4),
 (106, 'Frank', 'Grocery', Decimal('6400.00'), 5),
 (107, 'Grace', 'Grocery', Decimal('6400.00'), 6)]

In [4]:
%%sql
select * from (
    select emp_name,
           department,
           sales_amount,
           row_number() over(
               partition by department
               order by sales_amount desc
           ) as RN 
    from employee_sales
) t
where RN <= 3;

 * mysql+mysqlconnector://root:***@localhost
9 rows affected.

[('Eva', 'Electronics', Decimal('14500.00'), 1),
 ('Ian', 'Electronics', Decimal('14500.00'), 2),
 ('Sophia', 'Electronics', Decimal('14500.00'), 3),
 ('Hannah', 'Furniture', Decimal('9900.00'), 1),
 ('Mia', 'Furniture', Decimal('9900.00'), 2),
 ('Charlie', 'Furniture', Decimal('9100.00'), 3),
 ('Quinn', 'Grocery', Decimal('7500.00'), 1),
 ('Kevin', 'Grocery', Decimal('7200.00'), 2),
 ('Thomas', 'Grocery', Decimal('7200.00'), 3)]

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql

In [ ]:
%%sql